read_verilog improved_verilog/config.v improved_verilog/adder.v improved_verilog/adder_dsp.v improved_verilog/cpu.v improved_verilog/mux2to1.v improved_verilog/alu_control.v improved_verilog/pipeline_registers.v improved_verilog/alu.v improved_verilog/program_counter.v improved_verilog/branch_decide.v improved_verilog/forwarding_unit.v improved_verilog/branch_predictor.v improved_verilog/imm_gen.v improved_verilog/control_unit.v improved_verilog/instruction_mem.v improved_verilog/data_mem.v improved_verilog/register_file.v improved_verilog/CSR.v improved_verilog/dataMem_mask_gen.v improved_verilog/pll_clk.v improved_verilog/two_bit_branch_predictor.v improved_verilog/one_bit_branch_predictor.v improved_verilog/subtractor_dsp.v improved_verilog/static_branch_predictor.v improved_verilog/clk_divisor.v toplevel.v 

synth_ice40 -noflatten -blif sail_improved.blif

write_json sail_improved.json
